app/views/users/show.html.erb

SELECT  1 AS one FROM "events" WHERE "events"."user_id" = ? LIMIT 1  [["user_id", 11]]
---
  <div class="col-md-8">
    <% if @user.events.any? %>