app/controllers/events_controller.rb

	def create
		@event = current_user.events.build(event_params)
		if @event.save
---
INSERT INTO "events" ("description", "location", "date", "cost", "picture", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

	def destroy
		@event = Event.find(params[:id])
		@event.destroy
---
SELECT  "events".* FROM "events" WHERE "events"."id" = ?  ORDER BY "events"."created_at" DESC LIMIT 1  [["id", 301]]
DELETE FROM "events" WHERE "events"."id" = ?  [["id", 301]]