app/controllers/static_pages_controller.rb

SELECT  "events".* FROM "events" WHERE (user_id = 1)  ORDER BY "events"."created_at" DESC LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "events" WHERE "events"."user_id" = ?  [["user_id", 1]]
---
  def home
  	if logged_in?
	  	@event = current_user.events.build if logged_in?
	  	@feed_items = current_user.feed.paginate(page: params[:page])