app/controllers/users_controller.rb

  def show
  	@user = User.find(params[:id])
    @events = @user.events.paginate(page: params[:page])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 0]]
SELECT  "events".* FROM "events" WHERE "events"."user_id" = ?  ORDER BY "events"."created_at" DESC LIMIT 30 OFFSET 0  [["user_id", 1]]
SELECT COUNT(*) FROM "events" WHERE "events"."user_id" = ?  [["user_id", 1]]

   def create
  	@user = User.new(user_params)
  	if @user.save
---
INSERT INTO "users" ("name", "email", "username", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)